#+TITLE: CS Notes (Groups)
#+AUTHOR: Jesse Oldroyd
#+EMAIL: oldroyd.j@wvwc.edu
#+DESCRIPTION: CS notes for 2026 Summer Gifted class.
#+KEYWORDS: group theory, Rubik's cube
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_LINK_UP:
#+HTML_LINK_HOME:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LATEX_HEADER: \mode<beamer>{\usetheme{moloch}}
#+LATEX_HEADER: \molochset{block=fill}
#+LATEX_HEADER: \setbeameroption{show notes on second screen}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \definecolor{codegreen}{rgb}{0,0.6,0}
#+LATEX_HEADER: \definecolor{codegray}{rgb}{0.5,0.5,0.5}
#+LATEX_HEADER: \definecolor{codepurple}{rgb}{0.58,0,0.82}
#+LATEX_HEADER: \definecolor{backcolour}{rgb}{0.95,0.95,0.92}
#+LATEX_HEADER: \lstdefinestyle{pythonstyle}{
#+LATEX_HEADER:   backgroundcolor=\color{backcolour},
#+LATEX_HEADER:   commentstyle=\color{codegreen},
#+LATEX_HEADER:   keywordstyle=\color{magenta},
#+LATEX_HEADER:   numberstyle=\tiny\color{codegray},
#+LATEX_HEADER:   stringstyle=\color{codepurple},
#+LATEX_HEADER:   basicstyle=\ttfamily\footnotesize,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   captionpos=b,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   numbers=left,
#+LATEX_HEADER:   numbersep=5pt,
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   tabsize=2
#+LATEX_HEADER: }
#+LATEX_HEADER: \lstset{%
#+LATEX_HEADER:   language=python,
#+LATEX_HEADER:   numbers=left,
#+LATEX_HEADER:   style=pythonstyle,
#+LATEX_HEADER: }
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

** A Simple Group in Python                                        :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:END:
...and functions to represent the actions:
#+BEGIN_src python :exports both :session :results output
  # our action takes arrangement1 and turns it into arrangement2, and
  # vice-versa
  def group_action(arrangement):
      if arrangement[0] == 'penny':
          return arrangement2
      else:
          return arrangement1

  # check that this does what we want it to
  for object in objects:
      print(group_action(object))
#+end_src

#+RESULTS:
: ['nickel', 'penny']
: ['penny', 'nickel']

